Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/dismissal/constructive_dismissal.html.txt.tmx
Source language: en
Languages: ga

source: Constructive dismissal arises where you terminate your contract of employment, with or without prior notice, due to the conduct of your employer
ga: Tarlaíonn dífhostú nuair a chuireann tú deireadh le do chonradh fostaíochta, le nó gan fógra a thabhairt roimh ré, mar gheall ar iompar d'fhostóra

source: Your employer's conduct however must have been such that it would have been reasonable for you to terminate your contract without giving notice
ga: Caithfidh gur iompair d'fhostóir é/í i slí a chiallódh go mbeadh sé réasúnta duit deireadh a chur le d'fhostaíocht gan fógra a thabhairt

source: If you are dismissed you may, under certain conditions, bring a claim for unfair dismissal against your employer
ga: Má dhífhostaítear tú, tá sé de rogha agat éileamh dífhostú éagórach a chur in aghaidh d'fhostóra, faoi réir coinníollacha áirithe

source: If you do this and your employer accepts that there was a dismissal, it will be for your employer to show that there were fair grounds for the dismissal
ga: Má dhéanann tú é sin agus má ghlacann an fostóir leis go raibh dífhostú ann, beidh ar an bhfostóir a léiriú go raibh cúiseanna maithe leis an dífhostú

source: Generally a dismissal is presumed to be unfair unless your employer can show substantial grounds to justify it
ga: Go ginearálta, glactar leis go bhfuil dífhostú éagórach mura bhfuil an fostóir in ann a thaispeáint go raibh údar maith leis

source: However, if you terminate your employment and you claim constructive dismissal under the Unfair Dismissals Acts 1977–2015 it will be for you to prove that your resignation was justified
ga: Má chuireann tusa deireadh le d'fhostaíocht agus má dhéanann tú éileamh ar dhífhostú éagórach faoi reachtaíocht na nAchtanna un Dhífhostú Éagórach 1977-2015 beidh ortsa a chur in iúl go raibh údar maith le do chinneadh deireadh a chur le d'fhostaíocht

source: If you are found to have been unfairly dismissed you may be placed back in your job or more commonly, you may receive compensation for the loss of earnings caused by the dismissal
ga: Má shocraítear gur dífhostaíodh tú go héagórach, d'fhéadfadh go mbeadh ort filleadh ar do phost nó, níos minice, d'fhéadfá cúiteamh a fháil mar gheall ar chaillteanas tuilleamh mar thoradh ar an dífhostú

source: In general, you must have 12 months' continuous service with your employer to bring a claim for unfair dismissal
ga: Beidh ort a léiriú go gcáilíonn tú chun éileamh a dhéanamh faoi reachtaíocht na ndífhostaithe éagóracha

source: Under the unfair dismissals legislation in certain cases the 12 months' service is not a requirement
ga: Is féidir an teorainn ama a leathnú go 12 mhí i gcásanna nuair nach rabhthas in ann an t-éileamh a chur isteach mar gheall ar chúinsí eisceachtúla

source: If you wish to make a claim you should do so within 6 months of the date of the termination of employment
ga: Tá an ceart agat glacadh leis go bhfuil deireadh le do chonradh fostaíochta sna cásanna seo a leanas:

source: • Your employer's conduct amounts to an actual breach of the contract of employment or, although it falls short of such a breach, is serious enough to warrant your resignation
ga: • Má léiríonn iompar an fhostóra nach bhfuil sé/sí ag cloí a thuilleadh le téarmaí riachtanacha an chonartha

source: • Your employer has acted unreasonably
ga: • Má iompair an fostóir é/í féin i slí míréasúnta

source: Conduct by fellow employees that goes unchecked by your employer may also be taken into account in relation to constructive dismissal
ga: Mura dhéileáil an fostóir le hiompar fostaithe eile, cuirfear é sin san áireamh chomh maidir le dífhostú inchiallaithe

source: You should also note the following points:
ga: Ba cheart duit aird a thabhairt ar na pointí seo a leanas:

source: • In a constructive dismissal situation it is for you to prove that your resignation was justified
ga: • Nuair a bhíonn dífhostú inchiallaithe i gceist, is ortsa atá an dualgas le fiainise a thabhairt go raibh cúis maith agat le éirí as an bhfostaíocht

source: • You should use any complaints or grievance procedure that is available to you before resigning
ga: • Ba chóir duit aon nósanna imeachta araíonachta agus casaoide atá ar fáil duit a úsáid sula n-éiríonn tú as an bhfostaíocht

source: • You should also consider using any outside industrial relations procedures available to you before resigning
ga: • Ba chóir duit smaoineamh ar aon nósanna imeachta caidrimh thionsclaíochta atá ar fáil duit a úsáid sula n-éiríonn tú as d'fhostaíocht

source: • You should seek detailed advice before leaving as this is a complex area of law
ga: • Ba chóir duit moladh mionchruinn a lorg sula bhfágann tú mar is réimse casta dlí é sin

source: • You should only resign as a last resort after having used all available means of resolving the problem
ga: • Níor cheart duit éirí as an bhfostaíocht ach mar dhídean deiridh amháin tar éis duit leas a bhaint as gach slí eile ar fáil duit chun an fhadhb a réiteach

source: If you qualify under the unfair dismissals legislation, you may bring your claim to the Workplace Relations Commission
ga: Má cháilíonn tú faoin reachtaíocht dífhostaithe éagóracha, is féidir leat d'éileamh a thógáil ag an gCoimisiún um Chaidreamh san Áit Oibre

source: You make a claim by completing the online complaint form available on workplacerelations.ie
ga: Cuireann tú éileamh isteach tríd an fhoirm ghearáin ar líne á fáil ar workplacerelations.ie

source: Complaints will be referred to an adjudication officer for hearing
ga: Cuirfear gearáin faoi bhráid breithneora an Choimisiúin um Chaidreamh san Áit Oibre i gcomhair éisteacht

source: All decisions of an adjudication officer can be appealed to the Labour Court
ga: Tá ceart achomhairc chuig an Chúirt Oibreachais tar éis don breithneoir a chinneadh a dhéanamh

source: For more information in order to seek redress under the Acts contact Workplace Relations Commission's Information and Customer Service. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Le haghaidh tuilleadh eolais le cúiteamh a lorg faoin na hAchtanna téigh i dteagmháil leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre
